# -*- coding: utf-8 -*-
# Copyright (c) 2018, SpaceCode Co., Ltd. and contributors
# For license information, please see license.txt

import frappe
from frappe import _
from thai_wht.thai_wht.doctype.setup_progress.setup_progress import get_action_completed_state


@frappe.whitelist()
def get_user_progress_slides():
    setup_progress = frappe.get_value(
        doctype='Setup Progress',
        fieldname='done',
        as_dict=True)
    slides = []

    if setup_progress.done == '0':
        progress_slides = get_progress_slides()
        for s in progress_slides:
            s.done = get_action_completed_state(s.action_name) or 0
            slides.append(s)

    return slides


def get_progress_slides():
    return [
        frappe._dict(
            action_name='introduction',
            title='เริ่มต้นใช้งาน',
            help="""
            <p>ขอบคุณที่ให้ความสนใจโปรแกรมภาษีเงินได้ หัก ณ ที่จ่าย ออนไลน์</p>
            <p>
                <b>ขณะนี้คุณอยู่ในโหมดทดลองการใช้งาน</b>
                คุณสามารถทดลอง สร้าง ลบ แก้ไข ข้อมูลได้อย่างเต็มที่
            </p>
            <p>
                การใช้งานโปรแกรมโดยเบื้องต้น มีทั้งหมด 4 ฟังก์ชั่นหลักๆ คือ
            </p>
            <ul>
                <li>สร้างหนังสือรับรองการหักภาษี ณ ที่จ่าย</li>
                <li>สร้างแบบยื่นรายการภาษีเงินได้หัก ณ ที่จ่าย ภ.ง.ด.</li>
                <li>สร้างผู้มีหน้าที่หักภาษี ณ ที่จ่าย</li>
                <li>สร้างผู้ถูกหักภาษี ณ ที่จ่าย</li>
            </ul>
            <p>
                คุณสามารถกลับเข้ามาที่หน้านี้ ได้โดยกดที่ แท่งสีเขียว
                <img src="/assets/thai_wht/img/progress_bar.JPG" style="width: 40px">
                บริเวณด้านบน
            </p>
            """,
            fields=[],
        ),
        frappe._dict(
            action_name='addWhtCert',
            title='หนังสือรับรองการหักภาษี ณ ที่จ่าย',
            help="""
            <p>คุณสามารถออก หนังสือรับรองการหักภาษี ณ ที่จ่าย ได้โดยง่าย เพียงแค่กรอกข้อมูล</p>
            <ul>
                <li>แบบภ.ง.ด.</li>
                <li>ผู้ถูกหักภาษี ณ ที่จ่าย</li>
                <li>ผู้มีหน้าที่หักภาษี ณ ที่จ่าย</li>
                <li>ประเภทเงินได้ จำนวนเงินที่จ่าย และอัตราภาษีที่หัก</li>
            </ul>
            <p>
                โปรแกรมจะช่วยกรอกข้อมูลอื่นๆ เช่น ที่อยู่ของ ผู้ถูกหักภาษี ณ ที่จ่าย,
                ที่อยู่ของ ผู้มีหน้าที่หักภาษี ณ ที่จ่าย, เลขที่หนังสือรับรองการหักภาษี ณ ที่จ่าย
            </p>
            <hr>
            <p class="lead">เลขที่หนังสือรับรองการหักภาษี ณ ที่จ่าย</p>
            <p>
                เลขที่หนังสือรับรองการหักภาษี ณ ที่จ่ายจะอยู่ในรูปแบบ
                <b>WHT X YY MM ####</b> โดยแต่ละหลักจะมีความหมายดังนี้
            </p>
            <ul>
                <li>X ลำดับที่ ของ ผู้มีหน้าที่หักภาษี ณ ที่จ่าย [0-9]</li>
                <li>YY เลขท้าย 2 ตัว ของปีที่ออกหนังสือรับรอง</li>
                <li>MM เดือนที่ออกหนังสือรับรอง</li>
                <li>#### ลำดับที่ของหนังสือรับรอง เริ่มรันใหม่ทุกเดือน</li>
            </ul>
            <p>
                เช่น WHT018120001 หมายถึง หนังสือรับรองการหักภาษี ณ ที่จ่าย <br>
                ลำดับที่ 1 ของเดือน 12 ปี 2018 ของบริษัทลำดับที่ 0
            </p>
            <hr>
            <p class="lead">สถานะของเอกสารหนังสือรับรองการหักภาษี ณ ที่จ่าย</p>
            <img src="/assets/thai_wht/img/wht_workflow.png" class="img-responsive">
            <br>
            <ul>
                <li>
                    <b>Draft</b>
                     - เอกสารร่าง สามารถแก้ไข หรือลบเอกสารทิ้งได้
                </li>
                <li>
                    <b>Confirmed</b>
                     - เอกสารยืนยันแล้ว ไม่สามารถแก้ไขได้
                    หรือลบเอกสารทิ้งได้ แต่สามารถยกเลิกได้
                </li>
                <li>
                    <b>Submitted</b>
                     - เอกสารที่นำไปยื่น ภ.ง.ด. แล้ว ไม่สามารถแก้ไขหรือลบทิ้งได้
                </li>
                <li>
                    <b>Canceled</b>
                     - เอกสารที่ถูกยกเลิก ไม่สามารถแก้ไข หรือลบเอกสารทิ้งได้
                </li>
            </ul>
            <p>
                การออกแบบยื่นรายการภาษีเงินได้หัก ณ ที่จ่าย ภ.ง.ด. แบบอัตโนมัติ
                โปรแกรมจะดึงข้อมูลจากหนังสือรับรองการหักภาษี ณ ที่จ่าย ที่มีสถานะ Confirmed เท่านั้น
            </p>
            """,
            fields=[],
        ),
        frappe._dict(
            action_name='addPnd',
            title='แบบยื่นรายการภาษีเงินได้หัก ณ ที่จ่าย ภ.ง.ด.',
            help="""
            <p>
                คุณสามารถออก แบบยื่นรายการภาษีเงินได้หัก ณ ที่จ่าย ภ.ง.ด.
                ได้โดยไม่ต้องกรอกข้อมูลซ้ำซ้อน
            </p>
            <p>
                <b>
                    โปรแกรมจะทำการดึงข้อมูลจาก หนังสือรับรองการหักภาษี ณ ที่จ่าย
                    ที่มีสถานะ Confirmed
                </b>
                เพื่อสร้าง แบบยื่นรายการภาษีเงินได้หัก ณ ที่จ่าย ภ.ง.ด. โดยอัตโนมัติ
            </p>
            <hr>
            <p class="lead">สถานะของเอกสารแบบยื่นรายการภาษีเงินได้หัก ณ ที่จ่าย ภ.ง.ด.</p>
            <img src="/assets/thai_wht/img/pnd_workflow.png" class="img-responsive">
            <br>
            <ul>
                <li>
                    <b>Draft</b>
                     - เอกสารร่าง สามารถแก้ไข หรือลบเอกสารทิ้งได้
                </li>
                <li>
                    <b>Submitted</b>
                     - เอกสารยืนยันแล้ว ไม่สามารถแก้ไขหรือลบทิ้งได้
                </li>
            </ul>
            """,
            fields=[],
        ),
        frappe._dict(
            action_name='addWhder',
            title='ผู้มีหน้าที่หักภาษี ณ ที่จ่าย',
            help="""
            <p>
                <b>คุณสามารถเพิ่มผู้มีหน้าที่หักภาษี ณ ที่จ่าย ได้สูงสุด 10 บริษัท โดยไม่จำกัดจำนวนสาขา</b>
            </p>
            <ul>
                <li>
                    บริษัทที่เพิ่มในบัญชีเดียวกัน ควรเป็นบริษัทที่เกี่ยวเนื่องกัน เช่น บริษัทในเครือ หรือบริษัทลูก
                    ที่แชร์พนักงานร่วมกัน หรือแชร์ผู้ถูกหักภาษี ณ ที่จ่ายร่วมกัน
                </li>
                <li>
                    หากเป็นบริษัทที่ไม่เกี่ยวข้องกัน คุณสามารถสร้างบัญชีใหม่ได้ที่
                    <a href="https://pnd.in.th" target="_blank">https://pnd.in.th</a>
                </li>
            </ul>
            """,
            fields=[],
        ),
        frappe._dict(
            action_name='addWhdee',
            title='ผู้ถูกหักภาษี ณ ที่จ่าย',
            help="""
            <p>
                <b>คุณสามารถเพิ่มผู้ถูกหักภาษี ณ ที่จ่าย ได้อย่างไม่จำกัด</b>
            </p>
            <ul>
                <li>
                    ผู้ถูกหักภาษี ณ ที่จ่ายหนึ่งราย สามารถมี สาขาได้ไม่จำกัด<br>
                </li>
                <li>
                    สาขาหนึ่งสาขา ก็สามารถ มี ผู้ถูกหักภาษี ณ ที่จ่าย ได้ไม่จำกัดเช่นกัน<br>
                    เช่น กรณีที่อยู่ของคนงานต่างด้าว
                </li>
            </ul>
            """,
            fields=[],
        ),
        frappe._dict(
            action_name='deleteDemo',
            title='ลบข้อมูลตัวอย่าง',
            help="""
            <p>
                เมื่อคุณพร้อมแล้ว คุณสามารถลบข้อมูลตัวอย่าง และเริ่มต้นใช้งานจริงได้เลย<br>
                <b>เพียงกรอกพาสเวิร์ด และกด submit ด้านล่าง</b>
            </p>
            """,
            fields=[],
        ),
    ]
